# Data Cleaning Assignment

In [17]:
import pandas as pd
import numpy as np
import warnings
warnings.filterwarnings("ignore")

In [18]:
df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN',
'londON_StockhOlm',

'Budapest_PaRis', 'Brussels_londOn'],
'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )',
'12. Air France', '"Swiss Air"']})

In [19]:
l=[]
for i,j in enumerate(df['FlightNumber']):
    if str(j)=='nan':
        l.append(l[i-1]+10)
    else:
        l.append(j)
        
df['FlightNumber']=l

In [20]:
df['FlightNumber']=df['FlightNumber'].astype(int)

In [21]:
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris         10045      [23, 47]               KLM(!)
1      MAdrid_miLAN         10055            []    <Air France> (12)
2  londON_StockhOlm         10065  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis         10075          [13]       12. Air France
4   Brussels_londOn         10085      [67, 32]          "Swiss Air"

In [22]:
temp=pd.DataFrame()
l1=[]
l2=[]
for i in df['From_To']:
    l1.append(i.split('_')[0])
    l2.append(i.split('_')[1])
temp['From']=l1
temp['To']=l2

In [23]:
temp['From']=[ i.capitalize() for i in temp['From']]

In [24]:
temp['To']=[ i.capitalize() for i in temp['To']]

In [25]:
df.drop('From_To',axis=1,inplace=True)

In [26]:
temp

       From         To
0    London      Paris
1    Madrid      Milan
2    London  Stockholm
3  Budapest      Paris
4  Brussels     London

In [27]:
frames=[df,temp]

In [28]:
df=df.join(temp)

In [29]:
m=0
for i in df.RecentDelays:
    if len(i)>m:
        m=len(i)

In [30]:
for i in range(m):
    col_name='delay_'+str(i)
    df[col_name]=np.nan

In [31]:
for i,j in enumerate(df.RecentDelays):
    for k,m in enumerate(j):
        name='delay_'+str(k)
        df[name][i]=m

In [32]:
df

,FlightNumber,RecentDelays,Airline,From,To,delay_0,delay_1,delay_2
0,10045,"[23, 47]",KLM(!),London,Paris,23.0,47.0,NaN
1,10055,[],<Air France> (12),Madrid,Milan,NaN,NaN,NaN
2,10065,"[24, 43, 87]",(British Airways. ),London,Stockholm,24.0,43.0,87.0
3,10075,[13],12. Air France,Budapest,Paris,13.0,NaN,NaN
4,10085,"[67, 32]","""Swiss Air""",Brussels,London,67.0,32.0,NaN

In [33]:
df.drop('RecentDelays',axis=1)

,FlightNumber,Airline,From,To,delay_0,delay_1,delay_2
0,10045,KLM(!),London,Paris,23.0,47.0,NaN
1,10055,<Air France> (12),Madrid,Milan,NaN,NaN,NaN
2,10065,(British Airways. ),London,Stockholm,24.0,43.0,87.0
3,10075,12. Air France,Budapest,Paris,13.0,NaN,NaN
4,10085,"""Swiss Air""",Brussels,London,67.0,32.0,NaN